13/data/attachments/bbe13b40b5323487.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_ec6e5ccc-b544-4b3c-81fc-aa908783029c</nif:username>
            <nif:friendToBeAdded>James_push_Friend_92109_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>